# light_yolom.yaml
# YOLOv8-m compatible Light-YOLO-m model
# Designed for balanced performance and efficiency, larger than 's' size.

nc: 80 # number of classes (will be overridden by dataset if different)

# Light-YOLO backbone (SE-StarNet)
backbone:
  # [from, repeats, module, args]
  # Conv layers (width_multiple = 0.75)
  - [-1, 1, Conv, [48, 3, 2]]  # 0-P1/2: round(64 * 0.75 / 8) * 8 = 48
  - [-1, 1, Conv, [96, 3, 2]]  # 1-P2/4: round(128 * 0.75 / 8) * 8 = 96
  # SE_StarBlock layers (depth_multiple = 0.67, width_multiple = 0.75)
  - [-1, 2, SE_StarBlock, [96, True]] # 2: repeats = max(round(3 * 0.67), 1) = 2, channels = round(128 * 0.75 / 8) * 8 = 96
  - [-1, 1, Conv, [192, 3, 2]] # 3-P3/8: round(256 * 0.75 / 8) * 8 = 192
  - [-1, 4, SE_StarBlock, [192, True]] # 4 (P3 output): repeats = max(round(6 * 0.67), 1) = 4, channels = round(256 * 0.75 / 8) * 8 = 192
  - [-1, 1, Conv, [384, 3, 2]] # 5-P4/16: round(512 * 0.75 / 8) * 8 = 384
  - [-1, 4, SE_StarBlock, [384, True]] # 6 (P4 output): repeats = max(round(6 * 0.67), 1) = 4, channels = round(512 * 0.75 / 8) * 8 = 384
  - [-1, 1, Conv, [768, 3, 2]] # 7-P5/32: round(1024 * 0.75 / 8) * 8 = 768
  - [-1, 2, SE_StarBlock, [768, True]] # 8 (P5 output): repeats = max(round(3 * 0.67), 1) = 2, channels = round(1024 * 0.75 / 8) * 8 = 768
  # SPPF layer (width_multiple = 0.75)
  - [-1, 1, SPPF, [768, 5]]    # 9: channels = round(1024 * 0.75 / 8) * 8 = 768

# Light-YOLO neck (C2f-CSC modules)
neck:
  # [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 (cat with P4 from backbone)
  # C2f_CSC layers (depth_multiple = 0.67, width_multiple = 0.75)
  - [-1, 2, C2f_CSC, [384, True]] # 12: repeats = max(round(3 * 0.67), 1) = 2, channels = round(512 * 0.75 / 8) * 8 = 384
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 (cat with P3 from backbone)
  - [-1, 2, C2f_CSC, [192, True]] # 15 (P3/8-neck): repeats = max(round(3 * 0.67), 1) = 2, channels = round(256 * 0.75 / 8) * 8 = 192

  # Conv layers in Neck (width_multiple = 0.75)
  - [-1, 1, Conv, [192, 3, 2]] # 16: channels = round(256 * 0.75 / 8) * 8 = 192
  - [[-1, 12], 1, Concat, [1]] # 17 (cat with P4 from neck)
  - [-1, 2, C2f_CSC, [384, True]] # 18 (P4/16-neck): repeats = max(round(3 * 0.67), 1) = 2, channels = round(512 * 0.75 / 8) * 8 = 384

  - [-1, 1, Conv, [384, 3, 2]] # 19: channels = round(512 * 0.75 / 8) * 8 = 384
  - [[-1, 9], 1, Concat, [1]]  # 20 (cat with P5 from backbone/SPPF)
  - [-1, 2, C2f_CSC, [768, True]] # 21 (P5/32-neck): repeats = max(round(3 * 0.67), 1) = 2, channels = round(1024 * 0.75 / 8) * 8 = 768

# Light-YOLO head (Detect_LSCD_V3)
head:
  # Detect_LSCD_V3 hidc (width_multiple = 0.75)
  - [[15, 18, 21], 1, Detect_LSCD_V3, [nc, 192]] # hidc = round(256 * 0.75 / 8) * 8 = 192