# light_yolol.yaml
# YOLOv8-l compatible Light-YOLO-l model
# Designed for high performance

nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, SE_StarBlock, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, SE_StarBlock, [256, True]] # 4 (P3 output)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, SE_StarBlock, [512, True]] # 6 (P4 output)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, SE_StarBlock, [1024, True]] # 8 (P5 output)
  - [-1, 1, SPPF, [1024, 5]]    # 9

neck:
  # [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 (cat with P4 from backbone)
  - [-1, 3, C2f_CSC, [512, True]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 (cat with P3 from backbone)
  - [-1, 3, C2f_CSC, [256, True]] # 15 (P3/8-neck)

  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17 (cat with P4 from neck)
  - [-1, 3, C2f_CSC, [512, True]] # 18 (P4/16-neck)

  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 9], 1, Concat, [1]]  # 20 (cat with P5 from backbone/SPPF)
  - [-1, 3, C2f_CSC, [1024, True]] # 21 (P5/32-neck)

head:
    - [[15, 18, 21], 1, Detect_LSCD_V3, [nc, 256]]